insert into films(film_name, description, year, genre_id, minimal_age, duration_in_minutes, file_id)
values('Человек, который изменил всё', '2001 год. Менеджер бейсбольной команды Oakland Athletics' ||
                                       ' Билли Бин после проигрыша в ключевом матче команде New York Yankees,' ||
                                       ' которая обладает значительно большим бюджетом, решает в корне' ||
                                       ' изменить систему подбора игроков. Во время деловой поездки в Кливленд он ' ||
                                       'знакомится с молодым выпускником Йеля, экономистом Питером Брэндом, который' ||
                                       ' при помощи математических расчётов предлагает внедрить новаторскую' ||
                                       ' схему оценки полезности игроков, основываясь на показателях их личной статистики.',
       2011, 3, 18, 133, 1);

insert into films(film_name, description, year, genre_id, minimal_age, duration_in_minutes, file_id)
values('Криминальное чтиво', 'Двое бандитов Винсент Вега и Джулс Винфилд ведут философские беседы в перерывах между' ||
                             ' разборками и решением проблем с должниками криминального босса Марселласа ' ||
                             'Уоллеса. В первой истории Винсент проводит незабываемый вечер с' ||
                             ' женой Марселласа Мией. Во второй рассказывается о боксёре Бутче' ||
                             ' Кулидже, купленном Уоллесом, чтобы сдать бой. В третьей истории ' ||
                             'Винсент и Джулс по нелепой случайности попадают в неприятности. ',
       1994, 3, 18, 154, 2);

insert into films(film_name, description, year, genre_id, minimal_age, duration_in_minutes, file_id)
values('Форрест Гамп', 'Сидя на автобусной остановке, Форрест Гамп — не очень умный, но добрый и открытый парень' ||
                       ' — рассказывает случайным встречным историю своей необыкновенной жизни. С самого' ||
                       ' малолетства парень страдал от заболевания ног, соседские мальчишки дразнили его, но' ||
                       ' в один прекрасный день Форрест открыл в себе невероятные способности к бегу. Подруга' ||
                       ' детства Дженни всегда его поддерживала и защищала, но вскоре дороги их разошлись.',
       1994, 3, 16, 142, 3);

insert into films(film_name, description, year, genre_id, minimal_age, duration_in_minutes, file_id)
values('Терминатор', 'История противостояния солдата Кайла Риза и киборга-терминатора, прибывших в 1984 ' ||
                     'год из пост-апокалиптического будущего, где миром правят машины-убийцы, а ' ||
                     'человечество находится на грани вымирания.', 1985, 1, 16, 108, 4);

insert into films(film_name, description, year, genre_id, minimal_age, duration_in_minutes, file_id)
values('Игры разума', 'От всемирной известности до греховных глубин — все это познал на своей шкуре Джон Форбс' ||
                      ' Нэш-младший. Математический гений, он на заре своей карьеры сделал титаническую работу в' ||
                      ' области теории игр, которая перевернула этот раздел математики и практически принесла ' ||
                      'ему международную известность. Однако буквально в то же время заносчивый и пользующийся ' ||
                      'успехом у женщин Нэш получает удар судьбы, который переворачивает уже его собственную' ||
                      ' жизнь.', 2001, 3, 12, 135, 5);

insert into films(film_name, description, year, genre_id, minimal_age, duration_in_minutes, file_id)
values('Мишель Вальян: Жажда скорости', 'Главный герой фильма - бесстрашный и виртуозный автогонщик Мишель Вальян' ||
                                        ' - многократный победитель крупнейших авторалли мира. Победам и успехам' ||
                                        'его команды восторженно рукоплещет публика, ему завидуют побежденные ' ||
                                        'соперники. На сложнейшей трассе этой супер-гонки их ждет бескомпромиссная' ||
                                        ' и жестокая борьба не за первое место, а борьба за жизнь, когда коварство ' ||
                                        'соперников не знает границ.', 2003, 3, 18, 104, 6);

insert into films(film_name, description, year, genre_id, minimal_age, duration_in_minutes, file_id)
values('Легенда', 'Близнецы Реджи и Ронни Крэй — культовые фигуры преступного мира Великобритании 1960-х. Братья' ||
                  ' возглавляли самую влиятельную бандитскую группировку Ист-Энда. В их послужном списке были' ||
                  ' вооруженные грабежи, рэкет, поджоги, покушения, убийства и собственный ночной клуб, куда доезжали' ||
                  ' даже голливудские знаменитости. Среди их жертв — криминальные авторитеты Джек МакВитти и Джордж' ||
                  ' Корнелл.', 2015, 1, 18, 131, 7);

insert into films(film_name, description, year, genre_id, minimal_age, duration_in_minutes, file_id)
values('Одержимость', 'Эндрю мечтает стать великим. Казалось бы, вот-вот его мечта осуществится. Юношу замечает' ||
                      ' настоящий гений, дирижер лучшего в стране оркестра. Желание Эндрю добиться успеха быстро ' ||
                      'становится одержимостью, а безжалостный наставник продолжает подталкивать его все дальше и' ||
                      ' дальше – за пределы человеческих возможностей. Кто выйдет победителем из этой схватки?.',
                      2014, 3, 18, 106, 8);

-- матрица, однажды в голивуде, назад в будущее,
